In [1]:
import pandas as pd
from sqlalchemy import create_engine

# Kết nối tới database trong Docker
DB_CONNECTION_STRING = "postgresql://airflow:airflow@localhost:5432/canvas_dwh"
engine = create_engine(DB_CONNECTION_STRING)

# Lấy dữ liệu thật
query = """
SELECT 
    fs.*,
    ds.student_name
FROM 
    fact_submissions fs
JOIN 
    dim_students ds ON fs.student_id = ds.student_id;
"""
df = pd.read_sql(query, engine)

print(f"✅ Đã tải {len(df)} bản ghi từ Data Warehouse.")
df.head()

✅ Đã tải 192 bản ghi từ Data Warehouse.

,submission_id,student_id,assignment_id,submitted_at,grade,late,course_id,student_name
0,717856599,119404702,59108250,NaT,0.0,False,13087186,Nghĩa 1
1,717727399,119404702,59088301,NaT,0.0,False,13087186,Nghĩa 1
2,717727394,119404702,59088300,NaT,0.0,False,13087186,Nghĩa 1
3,717727389,119404702,59088299,NaT,0.0,False,13087186,Nghĩa 1
4,717611428,119404702,59071086,2025-10-10 06:41:58+00:00,10.0,False,13087186,Nghĩa 1